#Error - Cliente
CL_E_001=El n\u00famero de identificaci\u00f3n ingresado no es v\u00e1lido.
CL_E_002=No se pudo guardar la informaci\u00f3n del cliente, intente nuevamente.
CL_E_003=No se pudo recuperar la informaci\u00f3n del cliente, intente nuevamente.
CL_E_004=No se pudo actualizar la informaci\u00f3n del cliente, intente nuevamente.
CL_E_005=No se pudo procesar la eliminaci\u00f3n del cliente, intente nuevamente.
CL_E_006=No se pudo recuperar el listado de clientes, intente nuevamente.

#Error - Producto
PD_E_001=No se pudo guardar la informaci\u00f3n del producto, intente nuevamente.
PD_E_002=No se pudo recuperar la informaci\u00f3n del producto, intente nuevamente.
PD_E_003=No se pudo actualizar la informaci\u00f3n del producto, intente nuevamente.
PD_E_004=No se pudo procesar la eliminaci\u00f3n del producto, intente nuevamente.
PD_E_005=No se pudo recuperar el listado de productos, intente nuevamente.

#Error - Factura
FC_E_001=El n\u00famero de identificaci\u00f3n ingresado no es v\u00e1lido.
FC_E_002=No se pudo guardar la informaci\u00f3n de la factura, intente nuevamente.
FC_E_003=No se pudo recuperar la informaci\u00f3n de la factura, intente nuevamente.
FC_E_004=No se pudo actualizar la informaci\u00f3n de la factura, intente nuevamente.
FC_E_005=No se pudo procesar la eliminaci\u00f3n de la factura, intente nuevamente.
FC_E_006=No se pudo recuperar el listado de clientes, intente nuevamente.

#Informacion - Cliente
CL_I_001=Cliente registrado exitosamente.
CL_I_002=Cliente actualizado exitosamente.
CL_I_003=Cliente eliminado exitosamente.

#Informacion - Producto
PD_I_001=Producto registrado exitosamente.
PD_I_002=Producto actualizado exitosamente.
PD_I_003=Producto eliminado exitosamente.

#Informacion - Factura
FC_I_001=Factura registrada exitosamente.
FC_I_002=Factura actualizada exitosamente.
FC_I_003=Factura eliminada exitosamente.


#Advertencia \u2013 Cliente
CL_A_001=El cliente ya existe.
CL_A_002=No existen clientes registrados en el sistema.
CL_A_003=No se encontraron clientes con los criterios ingresados.
CL_A_004=El n\u00famero de identificaci\u00f3n es obligatorio.
CL_A_005=Debe contener exactamente 10 o 13 d\u00edgitos num\u00e9ricos.
CL_A_006=El nombre es obligatorio y debe contener solo letras.
CL_A_007=El nombre debe tener entre 2 y 40 caracteres.
CL_A_008=El tel\u00e9fono es obligatorio y debe contener solo n\u00fameros.
CL_A_009=El email es obligatorio y debe tener un formato v\u00e1lido (@ y .).
CL_A_010=La ciudad es obligatoria.
CL_A_011=La direcci\u00f3n es obligatoria y debe tener entre 2 y 60 caracteres.
CL_A_012=El tel\u00e9fono debe contener exactamente 10 d\u00edgitos num\u00e9ricos.

#Advertencia \u2013 Producto
PD_A_001=El producto ya existe.
PD_A_002=No existen productos registrados en el sistema.
PD_A_003=No se encontraron productos con los criterios ingresados.
PD_A_004=El c\u00f3digo del producto es obligatorio.
PD_A_005=El c\u00f3digo del producto no cumple el formato XXX-XX####.
PD_A_006=La descripci\u00f3n es obligatoria y debe tener entre 2 y 60 caracteres.
PD_A_007=La categor\u00eda es obligatoria.
PD_A_008=La unidad de compra es obligatoria.
PD_A_009=El precio de compra debe ser un valor positivo con m\u00e1ximo dos decimales.
PD_A_010=El precio de venta debe ser mayor o igual al precio de compra.
PD_A_011=El saldo inicial debe ser un n\u00famero entero mayor a cero.

#Advertencia \u2013 Factura
FC_A_001=No existen facturas registradas en el sistema.
FC_A_002=No existen facturas asociadas con el n\u00famero de identificaci\u00f3n.
FC_A_003=La cantidad del producto debe ser mayor a 0.
FC_A_004=El nombre es obligatorio y debe contener solo letras.
FC_A_005=Debe agregar al menos un producto a la factura.
FC_A_006=No se encontr\u00f3 la factura.
FC_A_007=\u00bfEst\u00e1 seguro de eliminar esta factura?
FC_A_008=Confirmar eliminaci\u00f3n
FC_A_009=Debe seleccionar un cliente v\u00e1lido para crear la factura
FC_A_010=Debe seleccionar un producto v\u00e1lido de la lista
FC_A_011=El tipo de factura debe ser POS (Point of Sale) o ECO (E-Commerce)